["Claymore anime and manga","You've got to see it.","27 Nov 2023",["Weeb"],"./images/clare.webp",0,"There's nothing more that I hate when manga or anime treat female characters poorly, almost inhumanly. For instance in Naruto, all of the female characters do not have their own motivation in life, no drive. Or how in other manga or anime they like to put the girls in a bad light whether it be the cinematography or the scenes and whatnot. But for once we have an anime / manga that focuses on strong female warriors who each have their own lives for once. All acts like human beings, fight to the death againts all odds for their own distict motivations and drives.",1,"Plot",0,"The plot is simple, there are some weird scenes that I will not discuss here, but other than that I can relate to most of the struggles that these characters faces, not to the degree by which I have to put my life on the line to fight demonic monsters of course. All in all the plot is mainly about our main character Clare who embarks on her journey for revenge. That's it, anything in between is just fillers to me but interesting notheless. I think plot wise the anime could be better, but I will have to read the manga later to see if it's any better.",1,"Clare",2,"./images/clare.webp",0,"Spoiler here but I wanted to talk about Clare for a bit. Clare had a really tough childhood, she found someone who is just in much pain as she is, they both became really close and found reason to live in each other's company. Unfortunately that person got killed and she was left alone again, but this time she made revenge be her sole drive and will to live. Now here's the best part, instead of other anime where the main character suddenly got to be arguably the strongest creature in their world, Clare was the weakest from the start to the end. Everyone rediculed her throughout her fights. But that didn't phase her, she didn't care if she is weak, all she wanted to do is to kill the person who took her friend. Throughout her journey she met new friends who in the end became her strength literally. Some anime always have the power of friendship magic scene where for whatever reason their friends are able to give them power through unknown magical means. Clare got strong because of the help of her comrades. Because of them lending her body parts, saving her life. This hits close to home for me, because I too struggle early on in life. I was the dumbest kid no matter how hard I presevere, but the people that cared about me gave me the strenght I need to be where I am now. I too am obsessed to wanting to be the best at what I do back then, but now I realize that the only reason to why we live is the people around us who wanted us to live. Vice versa.",0,"This is not my favourite but it was a good read / watch nonetheless."]